#### IndexStreamLine Members

---

|  |
| --- |
| IndexStreamLine Class   Methods   Properties   See Also |

The  IndexStreamLine  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddLine | Inserts a  IndexLine  segment into the stream and associated buffer. |
| Public method | AddLines | Inserts multiple  IndexLine  segments into the stream and associated buffer. |
| Public method | Dispose | (Inherited from  IndexStream  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  IndexStream  .) |

# See Also

IndexStreamLine Class

Autodesk.Revit.DB.DirectContext3D Namespace